mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xn/mb9bf36xn.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CLK_GATING" -->
    <peripheral>
      <name>CLK_GATING</name>
      <description>Peripheral Clock Gating</description>
      <version>A</version>
      <groupName>CLK_GATING</groupName>
      <baseAddress>0x4003C100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CKEN0" -->
        <register>
          <name>CKEN0</name>
          <description>Peripheral Function Clock Control Register 0 [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x150FFFFF</resetValue>
          <resetMask>0x150FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GIOCK" -->
            <field>
              <name>GIOCK</name>
              <description>Settings for operation clock supplying and gating to GPIO function</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EXBCK" -->
            <field>
              <name>EXBCK</name>
              <description>Settings for operation clock supplying and gating of external bus interface function</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMACK" -->
            <field>
              <name>DMACK</name>
              <description>Supplying and gating settings of DMAC operation clock</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCCK3" -->
            <field>
              <name>ADCCK3</name>
              <description>Settings for operation clock supplying and gating to A/D converter unit 3</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCCK2" -->
            <field>
              <name>ADCCK2</name>
              <description>Settings for operation clock supplying and gating to A/D converter unit 2</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCCK1" -->
            <field>
              <name>ADCCK1</name>
              <description>Settings for operation clock supplying and gating to A/D converter unit 1</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCCK0" -->
            <field>
              <name>ADCCK0</name>
              <description>Settings for operation clock supplying and gating to A/D converter unit 0</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK15" -->
            <field>
              <name>MFSCK15</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK14" -->
            <field>
              <name>MFSCK14</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK13" -->
            <field>
              <name>MFSCK13</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK12" -->
            <field>
              <name>MFSCK12</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK11" -->
            <field>
              <name>MFSCK11</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK10" -->
            <field>
              <name>MFSCK10</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK9" -->
            <field>
              <name>MFSCK9</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK8" -->
            <field>
              <name>MFSCK8</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK7" -->
            <field>
              <name>MFSCK7</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK6" -->
            <field>
              <name>MFSCK6</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK5" -->
            <field>
              <name>MFSCK5</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK4" -->
            <field>
              <name>MFSCK4</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK3" -->
            <field>
              <name>MFSCK3</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK2" -->
            <field>
              <name>MFSCK2</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK1" -->
            <field>
              <name>MFSCK1</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK0" -->
            <field>
              <name>MFSCK0</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
