mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xn/mb9bf36xn.svd
        <!-- REGISTER "HWINTCLR7" -->
        <register derivedFrom="HWINTCLR0">
          <name>HWINTCLR7</name>
          <description>Hardware transfer interrupt clear Register 7 [BHW]</description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "DQMSK0" -->
        <register>
          <name>DQMSK0</name>
          <description>DMA request mask Register 0 [BHW]</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DQMSK1" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK1</name>
          <description>DMA request mask Register 1 [BHW]</description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "DQMSK2" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK2</name>
          <description>DMA request mask Register 2 [BHW]</description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "DQMSK3" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK3</name>
          <description>DMA request mask Register 3 [BHW]</description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "DQMSK4" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK4</name>
          <description>DMA request mask Register 4 [BHW]</description>
          <addressOffset>0x80</addressOffset>
        </register>
        <!-- REGISTER "DQMSK5" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK5</name>
          <description>DMA request mask Register 5 [BHW]</description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "DQMSK6" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK6</name>
          <description>DMA request mask Register 6 [BHW]</description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "DQMSK7" -->
        <register derivedFrom="DQMSK0">
          <name>DQMSK7</name>
          <description>DMA request mask Register 7 [BHW]</description>
          <addressOffset>0x8C</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR0" -->
        <register>
          <name>DQMSKCLR0</name>
          <description>DMA request mask clear Register 0 [BHW]</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "DQMSKCLR1" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR1</name>
          <description>DMA request mask clear Register 1 [BHW]</description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR2" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR2</name>
          <description>DMA request mask clear Register 2 [BHW]</description>
          <addressOffset>0x98</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR3" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR3</name>
          <description>DMA request mask clear Register 3 [BHW]</description>
          <addressOffset>0x9C</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR4" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR4</name>
          <description>DMA request mask clear Register 4 [BHW]</description>
          <addressOffset>0xA0</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR5" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR5</name>
          <description>DMA request mask clear Register 5 [BHW]</description>
          <addressOffset>0xA4</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR6" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR6</name>
          <description>DMA request mask clear Register 6 [BHW]</description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "DQMSKCLR7" -->
        <register derivedFrom="DQMSKCLR0">
          <name>DQMSKCLR7</name>
          <description>DMA request mask clear Register 7 [BHW]</description>
          <addressOffset>0xAC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SDIF" -->
    <peripheral>
      <name>SDIF</name>
      <description>SD Card Interface</description>
      <version>A</version>
      <groupName>SDIF</groupName>
      <baseAddress>0x4006E000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x55</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x58</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFC</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x118</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x154</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "SD" -->
      <interrupt>
        <name>SD</name>
        <value>118</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "SSA2" -->
        <register>
          <name>SSA2</name>
          <description>SDMA System Address / Argument 2 Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "SBSIZE" -->
        <register>
          <name>SBSIZE</name>
          <description>Block Size Register [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HSDMABUFBD" -->
            <field>
              <name>HSDMABUFBD</name>
              <description>Host SDMA Buffer Boundary</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRSFBLCKSZ" -->
            <field>
              <name>TRSFBLCKSZ</name>
              <description>Transfer Block Size</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SBLCNT" -->
        <register>
          <name>SBLCNT</name>
          <description>Block Count Register [BHW]</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
