mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xn/mb9bf36xn.svd
        <!-- REGISTER "EPFR18" -->
        <register>
          <name>EPFR18</name>
          <description>Extended Pin Function Setting Register 18 [BHW]</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFFC3F0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDWPS" -->
            <field>
              <name>SDWPS</name>
              <description>S_WP input select bits</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCDS" -->
            <field>
              <name>SDCDS</name>
              <description>S_CD input select bits</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA3B" -->
            <field>
              <name>SDDATA3B</name>
              <description>SDDATA3 input/output select bits</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA2B" -->
            <field>
              <name>SDDATA2B</name>
              <description>SDDATA2 input/output select bits</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA1B" -->
            <field>
              <name>SDDATA1B</name>
              <description>SDDATA1 input/output select bits</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDDATA0B" -->
            <field>
              <name>SDDATA0B</name>
              <description>SDDATA0 input/output select bits</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCMDB" -->
            <field>
              <name>SDCMDB</name>
              <description>S_CMD input/output select bits</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDCLKE" -->
            <field>
              <name>SDCLKE</name>
              <description>S_CLK output select bits</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QZIN3S" -->
            <field>
              <name>QZIN3S</name>
              <description>QDU-ch3 ZIN input select bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QBIN3S" -->
            <field>
              <name>QBIN3S</name>
              <description>QDU-ch3 BIN input select bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QAIN3S" -->
            <field>
              <name>QAIN3S</name>
              <description>QDU-ch3 AIN input select bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR19" -->
        <register>
          <name>EPFR19</name>
          <description>Extended Pin Function Setting Register 19 [BHW]</description>
          <addressOffset>0x64C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR20" -->
        <register>
          <name>EPFR20</name>
          <description>Extended Pin Function Setting Register 20 [BHW]</description>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UED31B" -->
            <field>
              <name>UED31B</name>
              <description>UED31B input/output select bit</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED30B" -->
            <field>
              <name>UED30B</name>
              <description>UED30B input/output select bit</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED29B" -->
            <field>
              <name>UED29B</name>
              <description>UED29B input/output select bit</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED28B" -->
            <field>
              <name>UED28B</name>
              <description>UED28B input/output select bit</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED27B" -->
            <field>
              <name>UED27B</name>
              <description>UED27B input/output select bit</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED26B" -->
            <field>
              <name>UED26B</name>
              <description>UED26B input/output select bit</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED25B" -->
            <field>
              <name>UED25B</name>
              <description>UED25B input/output select bit</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED24B" -->
            <field>
              <name>UED24B</name>
              <description>UED24B input/output select bit</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED23B" -->
            <field>
              <name>UED23B</name>
              <description>UED23B input/output select bit</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED22B" -->
            <field>
              <name>UED22B</name>
              <description>UED22B input/output select bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED21B" -->
            <field>
              <name>UED21B</name>
              <description>UED21B input/output select bit</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED20B" -->
            <field>
              <name>UED20B</name>
              <description>UED20B input/output select bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED19B" -->
            <field>
              <name>UED19B</name>
              <description>UED19B input/output select bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED18B" -->
            <field>
              <name>UED18B</name>
              <description>UED18B input/output select bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED17B" -->
            <field>
              <name>UED17B</name>
              <description>UED17B input/output select bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UED16B" -->
            <field>
              <name>UED16B</name>
              <description>UED16B input/output select bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDTHHB" -->
            <field>
              <name>UEDTHHB</name>
              <description>UEDTHHB input/output select bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDQM3E" -->
            <field>
              <name>UEDQM3E</name>
              <description>UEDQM3E output select bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDQM2E" -->
            <field>
              <name>UEDQM2E</name>
              <description>UEDQM2E output select bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECSXE" -->
            <field>
              <name>UECSXE</name>
              <description>UECSXE output select bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UEDWEXE" -->
            <field>
              <name>UEDWEXE</name>
              <description>UEDWEXE output select bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UECASE" -->
            <field>
              <name>UECASE</name>
              <description>UECASE output select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UERASE" -->
            <field>
              <name>UERASE</name>
              <description>UERASE output select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UESMCEE" -->
            <field>
              <name>UESMCEE</name>
              <description>UESMCEE output select bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UESMCKE" -->
            <field>
              <name>UESMCKE</name>
              <description>UESMCKE output select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
